Revit 2026 API

# ConnectorDomainType Enumeration

---

Type of connector domain.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConnectorDomainType
```
```vb
Public Enumeration ConnectorDomainType
```
```cpp
public enum class ConnectorDomainType
```
```fsharp
type ConnectorDomainType
```

| Member name | Value | Description |
| --- | --- | --- |
| CableTrayConduit | 4 | Connector of cable trays or conduits |
| Electrical | 2 | Electrical connector |
| Hvac | 1 | HVAC (duct) connector |
| Piping | 3 | Piping connector |
| StructuralAnalytical | 5 | Connector of Structural Analytical Model |
| Undefined | 0 | Domain is undefined |

#### Reference

Autodesk.Revit.DB Namespace